import React from 'react';
import styles from './services.module.css';
import { ServiceItem } from './serviceItem';

export const Services = () => {
  return (
    <section className={styles.services} id="services">
      <h2 className={styles.title}>Послуги</h2>
      <div className={styles.content}>
        <ul className={styles.list}>
          {data.map((item) => (
            <ServiceItem data={item} />
          ))}
        </ul>
      </div>
    </section>
  );
};

const data = [
  {
    id: 'techControl',
    title: `1. ОТК. Обов'язковий технічний контроль транспортних засобів`,
    description: `ТОВ «АНВІТ ТРАНС СЕРВІС» проводить обов'язковий технічний контроль
  транспортних засобів та має право на проведення наступних категорій
  транспортних засобів: M (M1, M1G, M1S, M1GS, M2, M2G, M2S, M2GS, M3, M3S,
  M3GS) N (N1, N1G, N1S, N1GS, N2, N2G, N2S, N2GS, N3, N3S, N3GS) O (O1, O1S,
  O2, O2S, O3, O3S, O4, O4S окрім причепів/напівпричепів з інерційною гальмівною
  системою). Замовник для оформлення документів подає особисто: - паспорт або
  інший документ, що посвідчує особу (у разі подання документів уповноваженою
  особою така особа, крім документа, що зазначений в цьому абзаці, пред’являє
  виконавцю документ, що підтверджує її повноваження); 
  - свідоцтво про реєстрацію
  транспортного засобу.
  
  Періодичність проходження обов’язкового технічного
  контролю становить: 
  - для легкових автомобілів, що використовуються для
  перевезення пасажирів або вантажів з метою отримання прибутку, із строком експлуатації більше двох років - кожні два роки; 
  - для вантажних автомобілів незалежно від форми власності вантажопідйомністю до 3,5 тонни, причепів до них
  із строком експлуатації більше двох років - кожні два роки; 
  - для вантажних
  автомобілів вантажопідйомністю більше 3,5 тонни, причепів до них та таксі
  незалежно від строку експлуатації - щороку; 
  - для автобусів та спеціалізованих
  транспортних засобів, що перевозять небезпечні вантажі, незалежно від строку експлуатації - двічі на рік. 
  
  Розрахунковий оперативний час обов’язкового
  технічного контролю транспортного засобу загального призначення максимально
  становить: 
  - 30 (40) хвилин - для причепів (напівпричепів);
  - 40 хвилин - для легкових
  автомобілів; 
  - 60 хвилин - для вантажних автомобілів; 
  - 65 хвилин - для автобусів.
  
  Для спеціальних та спеціалізованих транспортних засобів або транспортних
  засобів, обладнаних додатковим устаткуванням, оперативний час може бути
  змінено.
  
  Номер в реєстрі суб’єктів проведення обов’язкового технічного контролю
  транспортних засобів ТОВ «АНВІТ ТРАНС СЕРВІС» №01782. 
  
  Місцезнаходження:
  08141, Київська обл., Бучанський район, с. Святопетрівське, вул. Петропавлівська, 8
  
  Контактні дані: 0967950793, otk@anvit.net
  
  Режим роботи: Пн-Пт з 09:00 до 18:00.
  
  Порядок проведення обов’язкового технічного контролю та обсяги перевірки
  технічного стану транспортних засобів затверджений постановою Кабінету
  Міністрів України від 30 січня 2012 р. № 137.
  http://zakon2.rada.gov.ua/laws/show/137-2012-%D0%BF).`,
  },
  {
    id: 'inspection',
    title: `2. Міжнародний технічний огляд (МСТО)`,
    description: `ТОВ «АНВІТ ТРАНС СЕРВІС» виконує випробування на відповідність колісних
  транспортних засобів вимогам Віденської угоди 1997 року - міжнародний
  технічний огляд, підтвердженням проходження якого є Міжнародний сертифікат
  технічного огляду (МСТО).
  
  У відповідності до Угоди про прийняття єдиних умов
  періодичних технічних оглядів колісних транспортних засобів і про взаємне
  визнання таких оглядів (Віденська угода 1997 року), колісні транспортні засоби, які
  використовуються в міжнародному сполученні, дозволена максимальна маса яких
  перевищує 3500 кг, повинні проходити періодичний технічний огляд (міжнародний
  техогляд) і підтвердженням цього є міжнародний сертифікат технічного огляду
  (МСТО). Перевірці МСТО підлягають вантажні автомобілі, тягачі, причіпи та
  напівпричіпи. 
  
  Перелік документів та вимоги до ТЗ (окрім відповідних вимог до
  технічного стану):
  1. Свідоцтво про реєстрацію транспортного засобу.
  2. Довіреність, у разі отримання послуг працівником ю.о.
  3. Наявність чинного калібрування тахографу.
  
  Термін дії МСТО – 1 рік з дати перевірки КТЗ, після закінчення цього терміну
  сертифікат може бути продовжений на підставі чергової перевірки шляхом
  внесення відповідного запису у той же бланк. Український протокол обов'язкового
  технічного контролю пройшов процедуру нотифікації в ЄС і приймається як
  альтернатива раніше використовуваної книжки МСТО. Власники транспортних
  засобів, які здійснили обов’язковий технічний контроль (державний техогляд),
  можуть додатково не отримувати Міжнародний сертифікат технічного огляду (МСТО), а за їх бажанням в протоколі обовя’зкового технічного контролю зазначаються слова такого змісту: “Міжнародний технічний огляд проведено”
  (Постанова КМУ від 30 січня 2012 р. №137). 
  
  Термін дії МСТО встановлюється в
  межах дії протокола обов’язкового технічного контролю, але не повинен
  перевищувати 12 місяців.
  
  Корисні посилання:
  1. Угода про прийняття єдиних умов періодичних технічних оглядів колісних
  транспортних засобів і про взаємне визнання таких оглядів
  http://zakon5.rada.gov.ua/laws/show/995_e51 
  2. Постанова КМУ від 30 січня 2012 р.
  №137 http://zakon0.rada.gov.ua/laws/show/137-2012-%D0%BF`,
  },
  { id: 'washing', title: `3. Мийка валикогабаритного транспорту` },
  { id: 'tire', title: `4. Послуги вантажного шиномонтажу` },
  {
    id: 'calibration',
    title: `5. Калібрування цифрових тахографів та зчитування данних з картки водія`,
    description: `(Номер пункту сервісу тахографів UA 341, згідно Переліку суб’єктів
      господарювання, що здійснюють установлення та технічне обслуговування
      тахографів в автомобільних транспортних засобах)`,
  },
];
