'use client';

import React, { useState } from 'react';
import styles from './serviceItem.module.css';

interface IServiceItemProps {
  data: { id: string; title: string; description?: string };
}

export const ServiceItem = ({ data }: IServiceItemProps) => {
  const [showDescription, setShowDescription] = useState(false);

  const showDescriptionButtonText = showDescription ? 'Закрити' : 'Детальніше';

  const handleShowDetailsPress = () => {
    setShowDescription((prev) => !prev);
  };

  const renderDescription = () => {
    switch (data.id) {
      case 'techControl':
        return <TechControlDescription />;
      case 'inspection':
        return <InspectionDescription />;
      case 'calibration':
        return <CalibrationDescription />;
      default:
        return null;
    }
  };

  return (
    <li className={styles.item}>
      <h3 className={styles.title}>{data?.title}</h3>
      {data?.description && showDescription ? renderDescription() : null}
      {data?.description ? (
        <button
          className={styles.show_details}
          type="button"
          onClick={handleShowDetailsPress}
        >
          {showDescriptionButtonText}
        </button>
      ) : null}
    </li>
  );
};

const TechControlDescription = () => {
  return (
    <p className={styles.description}>
      ТОВ «АНВІТ ТРАНС СЕРВІС» проводить обов'язковий технічний контроль
      транспортних засобів та має право на проведення наступних категорій
      транспортних засобів: M (M1, M1G, M1S, M1GS, M2, M2G, M2S, M2GS, M3, M3S,
      M3GS) N (N1, N1G, N1S, N1GS, N2, N2G, N2S, N2GS, N3, N3S, N3GS) O (O1,
      O1S, O2, O2S, O3, O3S, O4, O4S окрім причепів/напівпричепів з інерційною
      гальмівною системою).
      <br /> Замовник для оформлення документів подає особисто:
      <br />- паспорт або інший документ, що посвідчує особу (у разі подання
      документів уповноваженою особою така особа, крім документа, що зазначений
      в цьому абзаці, пред’являє виконавцю документ, що підтверджує її
      повноваження);
      <br />
      <br />- свідоцтво про реєстрацію транспортного засобу. Періодичність
      проходження обов’язкового технічного контролю становить:
      <br />- для легкових автомобілів, що використовуються для перевезення
      пасажирів або вантажів з метою отримання прибутку, із строком експлуатації
      більше двох років - кожні два роки;
      <br />- для вантажних автомобілів незалежно від форми власності
      вантажопідйомністю до 3,5 тонни, причепів до них із строком експлуатації
      більше двох років - кожні два роки;
      <br />- для вантажних автомобілів вантажопідйомністю більше 3,5 тонни,
      причепів до них та таксі незалежно від строку експлуатації - щороку;
      <br />- для автобусів та спеціалізованих транспортних засобів, що
      перевозять небезпечні вантажі, незалежно від строку експлуатації - двічі
      на рік.
      <br />
      <br />
      Розрахунковий оперативний час обов’язкового технічного контролю
      транспортного засобу загального призначення максимально становить:
      <br />- 30 (40) хвилин - для причепів (напівпричепів);
      <br />- 40 хвилин - для легкових автомобілів;
      <br />- 60 хвилин - для вантажних автомобілів;
      <br />- 65 хвилин - для автобусів.
      <br />
      <br />
      Для спеціальних та спеціалізованих транспортних засобів або транспортних
      засобів, обладнаних додатковим устаткуванням, оперативний час може бути
      змінено.
      <br />
      <br />
      Номер в реєстрі суб’єктів проведення обов’язкового технічного контролю
      транспортних засобів ТОВ «АНВІТ ТРАНС СЕРВІС» №01782. <br />
      Місцезнаходження: 08141, Київська обл., Бучанський район, с.
      Святопетрівське, вул. Петропавлівська, 8 <br />
      Контактні дані: 0967950793, otk@anvit.net <br />
      Режим роботи: Пн-Пт з 09:00 до 18:00.
      <br />
      Порядок проведення обов’язкового технічного контролю та обсяги перевірки
      технічного стану транспортних засобів затверджений постановою Кабінету
      Міністрів України від 30 січня 2012 р. № 137.
      <a href="http://zakon2.rada.gov.ua/laws/show/137-2012-%D0%BF)">
        http://zakon2.rada.gov.ua/laws/show/137-2012-%D0%BF)
      </a>
      .
    </p>
  );
};

const InspectionDescription = () => {
  return (
    <p className={styles.description}>
      ТОВ «АНВІТ ТРАНС СЕРВІС» виконує випробування на відповідність колісних
      транспортних засобів вимогам Віденської угоди 1997 року - міжнародний
      технічний огляд, підтвердженням проходження якого є Міжнародний сертифікат
      технічного огляду (МСТО). <br />
      <br />У відповідності до Угоди про прийняття єдиних умов періодичних
      технічних оглядів колісних транспортних засобів і про взаємне визнання
      таких оглядів (Віденська угода 1997 року), колісні транспортні засоби, які
      використовуються в міжнародному сполученні, дозволена максимальна маса
      яких перевищує 3500 кг, повинні проходити періодичний технічний огляд
      (міжнародний техогляд) і підтвердженням цього є міжнародний сертифікат
      технічного огляду (МСТО). Перевірці МСТО підлягають вантажні автомобілі,
      тягачі, причіпи та напівпричіпи. <br />
      <br />
      Перелік документів та вимоги до ТЗ (окрім відповідних вимог до технічного
      стану):
      <br />
      1. Свідоцтво про реєстрацію транспортного засобу. <br />
      2. Довіреність, у разі отримання послуг працівником ю.о. <br />
      3. Наявність чинного калібрування тахографу.
      <br />
      <br />
      Термін дії МСТО – 1 рік з дати перевірки КТЗ, після закінчення цього
      терміну сертифікат може бути продовжений на підставі чергової перевірки
      шляхом внесення відповідного запису у той же бланк. Український протокол
      обов'язкового технічного контролю пройшов процедуру нотифікації в ЄС і
      приймається як альтернатива раніше використовуваної книжки МСТО. Власники
      транспортних засобів, які здійснили обов’язковий технічний контроль
      (державний техогляд), можуть додатково не отримувати Міжнародний
      сертифікат технічного огляду (МСТО), а за їх бажанням в протоколі
      обовя’зкового технічного контролю зазначаються слова такого змісту:
      “Міжнародний технічний огляд проведено” (Постанова КМУ від 30 січня 2012
      р. №137). <br />
      <br />
      Термін дії МСТО встановлюється в межах дії протокола обов’язкового
      технічного контролю, але не повинен перевищувати 12 місяців.
      <br />
      <br />
      Корисні посилання: <br />
      1. Угода про прийняття єдиних умов періодичних технічних оглядів колісних
      транспортних засобів і про взаємне визнання таких оглядів:{' '}
      <a href="http://zakon5.rada.gov.ua/laws/show/995_e51">
        http://zakon5.rada.gov.ua/laws/show/995_e51
      </a>{' '}
      <br />
      2. Постанова КМУ від 30 січня 2012 р. №137:{' '}
      <a href="http://zakon0.rada.gov.ua/laws/show/137-2012-%D0%BF">
        http://zakon0.rada.gov.ua/laws/show/137-2012-%D0%BF
      </a>
    </p>
  );
};

const CalibrationDescription = () => {
  return (
    <p className={styles.description}>
      (Номер пункту сервісу тахографів UA 341, згідно Переліку суб’єктів
      господарювання, що здійснюють установлення та технічне обслуговування
      тахографів в автомобільних транспортних засобах)
    </p>
  );
};
